---
type: RebarShapeConstraintArcLength
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 1
tags: [revit-api, class]
---

# RebarShapeConstraintArcLength

`Autodesk.Revit.DB.Structure.RebarShapeConstraintArcLength` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | RebarShapeConstraintArcLength | 2012 | `public RebarShapeConstraintArcLength ( ElementId paramId )` |